#!/bin/bash

# スクリプトの概要

# 第一引数：引数の説明

# ==================================================
# 初期化
# ==================================================

# エラーログの設定
ERROR_LOG='path/to/file'
exec 2> >(while read -r line; do echo "$(date -Is): ${line}" >>"${ERROR_LOG}"; done)


# ==================================================
# 引数/環境チェック
# ==================================================

# 引数/環境チェック用変数
env_err=''
env_chk=0

# 引数/環境チェック用関数
err_add (){
    env_err="${env_err}${1}\n"
    env_chk=$((env_chk+1))
}

# some_command コマンドの存在確認
if ! type some_command >/dev/null; then
    err_add 'some_commandコマンドが存在しません'
fi

# 引数の個数チェック
if [ $# -ne 1 ]; then
    err_add '引数の個数が正しくありません'
fi

# 引数チェック結果判定
if [ $env_chk -ne 0 ]; then
    echo -e ${env_err}
    exit 1
fi


# ==================================================
# メイン処理
# ==================================================
